# **Tarea Nº 4**

- Fecha y hora de entrega: Domingo 12 de enero, 11:59pm
- Agregue los nombres de las personas con las que discutió esta tarea: ____ Armando Paredes ______
- Envíe su tarea haciendo el `push` de su código a su repo en GitHub Classroom:

### **Integrantes**

> Daphne Zegarra Zamora

> Natsumi Rivera Huanuco 

> Janela Arauco Orellana

### Evaluación

- Nota: **17/20**

¡Buen trabajo en general!

## **Mercado de autos usados**

Importa el conjunto de datos `neoauto_20240924.csv`

1. ¿Cuál es el precio promedio de los autos de cada marca (`item_brand`) publicados en cada subcategoría (`item_category_2`)?

In [18]:
# Solución
import numpy as np 
import pandas as pd

df_neoauto = pd.read_csv(r"C:\Users\ASUS\OneDrive\Documents\CICLO 2025-0\Fundamentos de Programación QLAB\tarea-4-zegarra-rivera-bueno\neoauto_20240924.csv", delimiter=",")
display(df_neoauto.head())

df_price = df_neoauto.groupby(['item_category_2','item_brand'])[['item_price']].mean().round(2)
display(df_price)

,value,item_id,item_price,item_name,item_category,item_category_2,item_brand,item_km,item_year,item_transmission,...,item_location_province,item_tag,item_advertiser,item_credit,item_verified,item_financed_by,santander_price,item_publication_slug,item_publication_type,item_publication_type_Id
0,29200,1807331,29200.0,toyota hilux 2021,autos,Pick Up,TOYOTA,51635.0,2021,Mecánica,...,lima,Como nuevo,Erick Bazán Ubaldo,True,True,Santander,NaN,auto/usado/toyota-hilux-2021-1807331,PREMIUM,25
1,98500,1807393,98500.0,lexus lx 600 2023,autos,Camionetas Suv,LEXUS,15000.0,2023,Automática - Secuencial,...,lima,Como nuevo,Asesor Gabriel NovoCar,False,True,NaN,NaN,auto/usado/lexus-lx-600-2023-1807393,PREMIUM,25
2,16800,1739308,17800.0,bmw 520-i 2016,autos,Sedan,BMW,66000.0,2016,Automática - Secuencial,...,lima,Ocasión,Carlos Chauca,True,True,Santander,16800.0,auto/usado/bmw-520-i-2016-1739308,PREMIUM,25
3,15900,1805714,16900.0,chevrolet captiva 2021,autos,Camionetas Suv,CHEVROLET,40300.0,2021,Automática - Secuencial,...,santa,Premium,Darwin Américo Barrón Pastor,True,True,Santander,15900.0,auto/usado/chevrolet-captiva-2021-1805714,PREMIUM,25
4,12500,1806332,12500.0,dfsk glory 500 2023,autos,Camionetas Suv,DFSK,33000.0,2023,Mecánica,...,lima,Premium,GORDILLO FERNANDO,True,True,Santander,NaN,auto/usado/dfsk-glory-500-2023-1806332,PREMIUM,25

                               item_price
item_category_2 item_brand
Camionetas Suv  ASTON MARTIN    229000.00
                AUDI             34602.42
                BAIC             10800.00
                BAIC YINXIANG     8500.00
                BMW              38377.80
...                                   ...
Vans            RAM               8883.33
                RENAULT           4900.00
                SUZUKI           11058.33
                TOYOTA           16080.00
                VOLKSWAGEN       14350.00

[202 rows x 1 columns]

2. ¿Cuántos autos tienen más de 100,000 kilómetros (`item_km`) pero un precio (`item_price`) menor al promedio general?

In [39]:
# Solución
promedio_general = df_neoauto['item_price'].mean()
print(f"El promedio general del precio es {round(promedio_general,2)}")

df_2 = df_neoauto[(df_neoauto['item_km'] > 100_000) & (df_neoauto['item_price'] < promedio_general)]
display(df_2.head())

autos = df_2.shape[0]
print(f"Hay {autos} autos que cumples con esas características")

El promedio general del precio es 22032.99

,value,item_id,item_price,item_name,item_category,item_category_2,item_brand,item_km,item_year,item_transmission,...,item_location_province,item_tag,item_advertiser,item_credit,item_verified,item_financed_by,santander_price,item_publication_slug,item_publication_type,item_publication_type_Id
9,14900,1807390,14900.0,mitsubishi nativa 2012,autos,Camionetas Suv,MITSUBISHI,148681.0,2012,Automática - Secuencial,...,lima,Premium,JC UGARTE,False,False,NaN,NaN,auto/usado/mitsubishi-nativa-2012-1807390,PREMIUM,25
13,9000,1806191,9000.0,hyundai tucson 2009,autos,Camionetas Suv,HYUNDAI,139000.0,2009,Automática,...,lima,Ocasión,Luis Pardo,False,False,NaN,NaN,auto/usado/hyundai-tucson-2009-1806191,PREMIUM,25
24,19000,1807372,19000.0,toyota land cruiser 2001,autos,Camionetas Suv,TOYOTA,408000.0,2001,Automática,...,lima,Ocasión,Jean Paul Gondonneau,False,False,NaN,NaN,auto/usado/toyota-land-cruiser-2001-1807372,PREMIUM,25
31,10000,1807318,10000.0,ford fusion 2015,autos,Sedan,FORD,115510.0,2015,Automática,...,lima,Seminuevo,JUAN JOSE YOMONA,True,False,Santander,NaN,auto/usado/ford-fusion-2015-1807318,PREMIUM,25
127,15900,1807166,15900.0,volkswagen tiguan 2015,autos,Camionetas Suv,VOLKSWAGEN,114000.0,2015,Automática - Secuencial,...,lima,Unico Dueño,Sebastian de Souza,True,False,Santander,NaN,auto/usado/volkswagen-tiguan-2015-1807166,PREMIUM,25

Hay 497 autos que cumples con esas características

3. Encuentra el modelo (`item_name`) más caro y el más barato de cada marca (`item_brand`).

In [51]:
# Solución
modelos_mas_caros = df_neoauto.loc[df_neoauto.groupby('item_brand')['item_price'].idxmax(), ['item_brand', 'item_name', 'item_price']]

modelos_mas_baratos = df_neoauto.loc[df_neoauto.groupby('item_brand')['item_price'].idxmin(), ['item_brand', 'item_name', 'item_price']]

print("Modelos más caros por marca:")
display(modelos_mas_caros)
print("\nModelos más baratos por marca:")
display(modelos_mas_baratos)

Modelos más caros por marca:

        item_brand                 item_name  item_price
1362    ALFA-ROMEO       alfa-romeo 147 2006      8500.0
1313  ASTON MARTIN     aston martin dbx 2021    229000.0
1208          AUDI            audi rs 6 2024    220000.0
3708        AUSTIN   austin mini cooper 1970         1.0
2317          BAIC             baic x55 2021     12800.0
...            ...                       ...         ...
3396           SWM          swm g05 pro 2022     14000.0
3582        TOYOTA         toyota hilux 2019    100000.0
1845       TRIUMPH         triumph tr-7 1971     18900.0
1373    VOLKSWAGEN  volkswagen teramont 2023     48900.0
1417         VOLVO          volvo xc-90 2023     84990.0

[73 rows x 3 columns]

Modelos más baratos por marca:

        item_brand                       item_name  item_price
2593    ALFA-ROMEO         alfa-romeo alfasud 1982      2500.0
1063  ASTON MARTIN          aston martin db11 2017    149900.0
633           AUDI              audi a3 sedan 2015         0.0
3708        AUSTIN         austin mini cooper 1970         1.0
2622          BAIC                  baic plus 2018      7500.0
...            ...                             ...         ...
3396           SWM                swm g05 pro 2022     14000.0
2690        TOYOTA  toyota land cruiser prado 2011         0.0
1845       TRIUMPH               triumph tr-7 1971     18900.0
360     VOLKSWAGEN            volkswagen bora 2015         0.0
2094         VOLVO            volvo 850 turbo 1995      2100.0

[73 rows x 3 columns]

4. Encuentra las tres marcas con mayor número de autos financiados por Santander (`item_financed_by`).

In [59]:
# Solución
df_neoauto.head()

null_sum = df_neoauto.isna().sum()
display(null_sum)

"Podemos observar que Santander tiene bastante nulos. Eliminaremos esas filas"

df_neoauto_corregido = df_neoauto.dropna()
df_neoauto_corregido.isna().sum()

df_4 = df_neoauto_corregido.groupby(['item_brand'])[['item_financed_by']].count()
display(df_4.sort_values(["item_financed_by"], ascending = False).head(3))

print("Las marcas más financiadas por Santander son: BMW, TOYOTA, MAZDA")

value                          0
item_id                        0
item_price                     0
item_name                      0
item_category                  0
item_category_2                0
item_brand                     0
item_km                        0
item_year                      0
item_transmission              0
item_fuel                      0
price                          0
item_location_city             0
item_location_province         0
item_tag                    2435
item_advertiser                0
item_credit                    0
item_verified                  0
item_financed_by             781
santander_price             2964
item_publication_slug          0
item_publication_type          0
item_publication_type_Id       0
dtype: int64

            item_financed_by
item_brand
BMW                       42
TOYOTA                    25
MAZDA                     24

Las marcas más financiadas por Santander son: BMW, TOYOTA, MAZDA

5. Agrupa las publicaciones por tipo de transmisión (`item_transmission`) y calcula la desviación estándar del precio (`item_price`) para cada tipo.

In [62]:
# Solución
df_publicaciones = df_neoauto.groupby(['item_transmission'])[['item_price']].std().round(2)
df_publicaciones

                         item_price
item_transmission
Automática                 15332.73
Automática - Secuencial    22678.64
Mecánica                    8137.12

6. ¿Cuál es el kilometraje promedio de las publicaciones con el tag "Premium" y de las publicaciones con el tag "Como nuevo"?

In [75]:
# Solución
df_premium = df_neoauto[(df_neoauto['item_tag'] == 'Premium')]
df_como_nuevo = df_neoauto[(df_neoauto['item_tag'] == 'Como nuevo')]

kilometraje_promedio_premium = df_premium['item_km'].mean().round(2)
kilometraje_promedio_como_nuevo = df_como_nuevo['item_km'].mean().round(2)

print(f"El kilometraje promedio de la publicaciones con el tag 'Premium' son {kilometraje_promedio_premium} y con el tag 'Como nuevo' son {kilometraje_promedio_como_nuevo}")

El kilometraje promedio de la publicaciones con el tag 'Premium' son 48400.24 y con el tag 'Como nuevo' son 35963.48

7. ¿Cuáles son las marcas de vehículas para los que todos sus modelos fabricados en los últimos 5 años tienen al menos 5 publicaciones cada una?

In [96]:
# Solución

df_ultimos_5_años = df_neoauto[df_neoauto['item_year'] >= (2025 - 5)]

conteo_publicaciones = df_ultimos_5_años.groupby(['item_brand', 'item_name']).size()

modelos_validos = conteo_publicaciones[conteo_publicaciones >= 5]
modelos_validos

item_brand  item_name
AUDI        audi q5 2021                       8
BMW         bmw 218i gran coupe 2021           7
            bmw 218i gran coupe 2022           6
            bmw 418i gci 2020                  5
            bmw x3 20i 2020                    6
                                              ..
VOLKSWAGEN  volkswagen taos 2022               6
            volkswagen tiguan allspace 2020    8
            volkswagen tiguan allspace 2021    5
VOLVO       volvo xc-40 2022                   5
            volvo xc-60 2022                   5
Length: 63, dtype: int64

## **Evolución económica internacional**

Importa el conjunto de datos de la hoja "Data" del archivo `pwt1001.xlsx`. El diccionario de variables está disponible en la hoja "Legend" del archivo Excel.

1. Calcule el PBI per cápita real ajustado por poder de paridad de compra (PPP). Use la variable de PBI que se calcula por gasto y la población. ¿Cuáles son los 10 países top?

In [9]:
# Solución

import pandas as pd
archivo_excel = "pwt1001.xlsx"
datos = pd.read_excel(archivo_excel, sheet_name='Data')

#display(datos.head())

columna_pbi_ppp = "rgdpe"  # Variable de PBI real ajustado por PPP
columna_poblacion = "pop"  # Variable de población
columna_pais = "country" # Nombre del país
columna_año = "year"   # Año

# Calcular PBI per cápita (PPP)
datos["pbi_per_capita_ppp"] = datos[columna_pbi_ppp] / datos[columna_poblacion]

# Cómo son datos panel filtraremos los resultados de los 10 paises top en el año 2019
datos_filtrados = datos[datos[columna_año] == 2019]

# Ordenar los países por PBI per cápita de mayor a menor
top_10 = datos_filtrados.sort_values(by="pbi_per_capita_ppp", ascending=False).head(10)

print("Top 10 países por PBI per cápita (PPP) en 2019:")
print(top_10[[columna_pais, "pbi_per_capita_ppp"]])

Top 10 países por PBI per cápita (PPP) en 2019:
                    country  pbi_per_capita_ppp
7209             Luxembourg       112941.453342
7349       China, Macao SAR       105337.890061
9799                  Qatar       103445.127269
5599                Ireland       102353.631443
10289             Singapore        88619.305271
1609                Bermuda        79967.588736
2239            Switzerland        71831.637057
3079         Cayman Islands        70208.345162
349    United Arab Emirates        69753.215256
1889      Brunei Darussalam        67555.392597

2. Genera el ránking de los países con el mayor incremento del PBI per cápita real PPP entre los años 1990 y 2019. ¿Dónde se ubica Perú? Para los países que no tengan información para dichos años, puede utilizar datos provenientes de hasta dos años antes o después

In [42]:
#Solución
#  Filtrar los datos para los años 1990 y 2019 (o hasta dos años antes o después)
datos_1990 = datos[(datos[columna_año] >= 1988) & (datos[columna_año] <= 1992)]
datos_2019 = datos[(datos[columna_año] >= 2017) & (datos[columna_año] <= 2021)]

# Obtener el PBI per cápita real PPP para 1990 y 2019
pbi_1990 = datos_1990.groupby(columna_pais)['pbi_per_capita_ppp'].mean().reset_index()
pbi_2019 = datos_2019.groupby(columna_pais)['pbi_per_capita_ppp'].mean().reset_index()

# Renombrar las columnas
pbi_1990 = pbi_1990.rename(columns={'pbi_per_capita_ppp': 'pbi_1990'})
pbi_2019 = pbi_2019.rename(columns={'pbi_per_capita_ppp': 'pbi_2019'})

# Unir los datos de 1990 y 2019
incremento_pbi = pd.merge(pbi_1990, pbi_2019, on=columna_pais)

# Calcular el incremento del PBI per cápita real PPP
incremento_pbi['incremento_pbi'] = incremento_pbi['pbi_2019'] - incremento_pbi['pbi_1990']

# Ordenar los países por el incremento del PBI per cápita real PPP de mayor a menor
ranking_incremento_pbi = incremento_pbi.sort_values(by='incremento_pbi', ascending=False).reset_index(drop=True)

# Determinar la posición de Perú en el ránking
posicion_peru = ranking_incremento_pbi[ranking_incremento_pbi[columna_pais] == 'Peru'].index[0] + 1

print(f"El ránking de los países con el mayor incremento del PBI per cápita real PPP entre 1990 y 2019 es:")
display(ranking_incremento_pbi[[columna_pais, 'incremento_pbi']])

print(f"Perú se ubica en la posición {posicion_peru} del ránking.")

El ránking de los países con el mayor incremento del PBI per cápita real PPP entre 1990 y 2019 es:

                                country  incremento_pbi
0                      China, Macao SAR    80511.395627
1                                 Qatar    80399.632864
2                               Ireland    73919.053738
3                             Singapore    66580.431427
4                            Luxembourg    65899.533934
..                                  ...             ...
178                          Montserrat    -7656.453250
179  Venezuela (Bolivarian Republic of)    -8630.757087
180                United Arab Emirates   -46029.423600
181                             Curaçao             NaN
182           Sint Maarten (Dutch part)             NaN

[183 rows x 2 columns]

Perú se ubica en la posición 83 del ránking.

3. Para el periodo 2010-2019, calcule el promedio del índice del capital humano. ¿Qué relación existe entre esta variable y el PBI per cápita real PPP calculado previamente? ¿y el número de horas laboradas al año por los trabajadores?

In [38]:
# Solución
datos = datos.rename(columns={'hc': 'Índice de Capital Humano'})

#Paso1: Filtrar los datos para el periodo 2010-2019
datos_periodo = datos[(datos['year'] >= 2010) & (datos['year'] <= 2019)]

#Paso2: Calcular el promedio del Índice de Capital Humano por país 
promedio_hc = datos_periodo.groupby('country')['Índice de Capital Humano'].mean().reset_index() 
print(promedio_hc) 

#Paso3: Relación entre el PBI per cápita y el Índice de Capital Humano
correlacion_hc_pbi = datos_periodo[['country', 'Índice de Capital Humano', 'pbi_per_capita_ppp']].groupby('country').mean()
correlacion_hc_pbi = correlacion_hc_pbi.corr()  # Correlación de Pearson entre las variables
print('Correlación entre Índice de Capital Humano y PBI per cápita real PPP:')
print(correlacion_hc_pbi)

#Paso 4: Relación entre el Índice de capital humano y el numero de horas laboradas al año por los trabajadores
correlacion_hc_horas = datos_periodo[['country', 'Índice de Capital Humano', 'avh']].groupby('country').mean()
correlacion_hc_horas = correlacion_hc_horas.corr()  # Correlación de Pearson entre las variables
print('Correlación entre Índice de Capital Humano y Horas Laboradas al Año:')
print(correlacion_hc_horas)

                                country  Índice de Capital Humano
0                               Albania                  2.934304
1                               Algeria                  2.207947
2                                Angola                  1.449344
3                              Anguilla                       NaN
4                   Antigua and Barbuda                       NaN
..                                  ...                       ...
178  Venezuela (Bolivarian Republic of)                  2.738341
179                            Viet Nam                  2.647214
180                               Yemen                  1.613632
181                              Zambia                  2.465329
182                            Zimbabwe                  2.554634

[183 rows x 2 columns]
Correlación entre Índice de Capital Humano y PBI per cápita real PPP:
                          Índice de Capital Humano  pbi_per_capita_ppp
Índice de Capital Humano                  1.000000            0.597898
pbi_per_capita_ppp                        0.597898            1.000000
Correlación entre Índice de Capital Humano y Horas Laboradas al Año:
                          Índice de Capital Humano      avh
Índice de Capital Humano                   1.00000 -0.57698
avh                                       -0.57698  1.00000

Interpretación correlación entre indice del capital humano, pbi percapita real PPP y horas laboradas al año: 

- Correlación positiva fuerte entre Índice de Capital Humano y PIB per cápita: Un coeficiente de correlación de 0.597898 indica una relación positiva moderadamente fuerte entre ambas variables. Esto significa que, en general, los países con un índice de capital humano más alto tienden a tener un PIB per cápita más elevado.

- Correlación negativa moderada entre Índice de Capital Humano y Horas Trabajadas: Un coeficiente de correlación de -0.57698 indica una relación negativa moderada entre ambas variables. Esto sugiere que, en promedio, los países con un índice de capital humano más alto suelen tener menos horas trabajadas por persona al año.

4. A partir de la variable del precio de los hogares, calcula los países y los años en los cuales se registró la mayor inflación anual para todo el periodo de tiempo disponible en la base de datos

In [26]:
# Solución
datos = datos.rename(columns={'pl_c': 'precios'})
datos = datos.sort_values(by=['country', 'year'])
datos['Inflación Anual'] = datos.groupby('country')['precios'].pct_change() * 100
max_inflacion = datos.loc[datos.groupby('country')['Inflación Anual'].idxmax()]
print(max_inflacion[['country', 'year', 'Inflación Anual']])

                                  country  year  Inflación Anual
256                               Albania  1996        36.428398
3608                              Algeria  1988        23.769727
119                                Angola  1999       144.032916
181                              Anguilla  1991        25.789678
524                   Antigua and Barbuda  1984        40.489905
...                                   ...   ...              ...
12387  Venezuela (Bolivarian Republic of)  2017       355.748049
12494                            Viet Nam  1984        42.464410
12597                               Yemen  2017        31.108906
12708                              Zambia  1988        60.785233
12795                            Zimbabwe  2005       281.705724

[183 rows x 3 columns]

C:\Users\Leo\AppData\Local\Temp\ipykernel_12596\1945211753.py:4: FutureWarning: The default fill_method='ffill' in SeriesGroupBy.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  datos['Inflación Anual'] = datos.groupby('country')['precios'].pct_change() * 100

5. ¿Cuáles son los países con la mayor cantidad de missing values en la variable de productividad total de factores a precios corrientes?

In [36]:
#Solución
datos = datos.rename(columns={'ctfp': 'productividad total'})
valores_faltantes_ctfp = datos.groupby('country')['productividad total'].apply(lambda x: x.isnull().sum())
valores_faltantes_ctfp = valores_faltantes_ctfp.sort_values(ascending=False)
print(valores_faltantes_ctfp.head(10))

country
Albania                           70
Turkmenistan                      70
Sint Maarten (Dutch part)         70
Grenada                           70
Ghana                             70
Georgia                           70
Gambia                            70
St. Vincent and the Grenadines    70
Pakistan                          70
Ethiopia                          70
Name: productividad total, dtype: int64

6.  Agrupa los datos por país y calcula el promedio de las horas trabajadas anuales (avh) y de la educación promedio (hc) para el periodo 2000-2020.

In [41]:
#Solución
datos_periodo_2000_2020 = datos[(datos['year'] >= 2000) & (datos['year'] <= 2020)]
promedio_avh_hc = datos_periodo_2000_2020.groupby('country')[['avh', 'Índice de Capital Humano']].mean().reset_index()
print(promedio_avh_hc)

                                country          avh  Índice de Capital Humano
0                               Albania          NaN                  2.895579
1                               Algeria          NaN                  2.080837
2                                Angola          NaN                  1.399746
3                              Anguilla          NaN                       NaN
4                   Antigua and Barbuda          NaN                       NaN
..                                  ...          ...                       ...
178  Venezuela (Bolivarian Republic of)  1874.516018                  2.538335
179                            Viet Nam  2243.230824                  2.407059
180                               Yemen          NaN                  1.444725
181                              Zambia          NaN                  2.304970
182                            Zimbabwe          NaN                  2.388763

[183 rows x 3 columns]

7.  Genere una variable que ordene a los países según el porcetaje de formación brutal de capital del 2019. Luego, estable diez grupos a manera de deciles. ¿En qué decil se ubica Péru? Vuelva a calcular usando la información de 1990. ¿El Perú se mantiene en el mismo décil o cambia?

In [40]:
# Solución

# Filtrar los datos para el año 2019
datos_2019 = datos[datos['year'] == 2019]

# Ordenar los países según el porcentaje de formación bruta de capital (csh_i)
datos_2019 = datos_2019.sort_values(by='csh_i', ascending=False).reset_index(drop=True)

# Crear una nueva columna para los deciles
datos_2019['decile'] = pd.qcut(datos_2019['csh_i'], 10, labels=False) + 1

# Encontrar el decil en el que se ubica Perú en 2019
decil_peru_2019 = datos_2019[datos_2019['country'] == 'Peru']['decile'].values[0]
print(f"En 2019, Perú se ubica en el decil {decil_peru_2019}.")

# Filtrar los datos para el año 1990
datos_1990 = datos[datos['year'] == 1990]

# Ordenar los países según el porcentaje de formación bruta de capital (csh_i)
datos_1990 = datos_1990.sort_values(by='csh_i', ascending=False).reset_index(drop=True)

# Crear una nueva columna para los deciles
datos_1990['decile'] = pd.qcut(datos_1990['csh_i'], 10, labels=False) + 1

# Encontrar el decil en el que se ubica Perú en 1990
decil_peru_1990 = datos_1990[datos_1990['country'] == 'Peru']['decile'].values[0]
print(f"En 1990, Perú se ubica en el decil {decil_peru_1990}.")

# Comparar los deciles
if decil_peru_2019 == decil_peru_1990:
    print("Perú se mantiene en el mismo decil en 2019 y 1990.")
else:
    print("Perú cambia de decil entre 1990 y 2019.")

En 2019, Perú se ubica en el decil 5.
En 1990, Perú se ubica en el decil 4.0.
Perú cambia de decil entre 1990 y 2019.

## **Transacciones Financieras**

Importa el conjunto de datos `base_financiera.csv`

In [20]:
import pandas as pd

base_financiera = "C:\\Users\\janel\\OneDrive\\Documentos\\GitHub\\tarea-4-zegarra-rivera-bueno\\base_financiera.csv"
df_base_financiera = pd.read_csv(base_financiera, delimiter=",")
print(df_base_financiera.head())

   Transaction_ID Customer_ID        Date   Amount Transaction_Type Region
0            1001        C190  2023-01-01   798.68           Credit  North
1            1002        C016  2023-01-02   906.97            Debit  South
2            1003        C033  2023-01-03  1579.96            Debit  South
3            1004        C142  2023-01-04  1579.62           Credit   East
4            1005        C035  2023-01-05  3719.21            Debit  North

8. Filtra todas las transacciones de tipo "Debit" en las que el monto sea mayor a 200, y calcula el monto total de esas transacciones. Además, determina cuántos clientes únicos realizaron esas transacciones.

In [21]:
# Solución
debit_transactions = df_base_financiera[(df_base_financiera["Transaction_Type"] == "Debit") & (df_base_financiera["Amount"] > 200)]

# Monto total de estas transacciones
total_debit_amount = debit_transactions["Amount"].sum()
# Clientes únicos que realizaron estas transacciones
unique_customers_debit = debit_transactions["Customer_ID"].nunique()

print(f"Monto total de transacciones 'Debit' > 200: {total_debit_amount}")
print(f"Número de clientes únicos: {unique_customers_debit}")

Monto total de transacciones 'Debit' > 200: 2847871.75
Número de clientes únicos: 200

9. Identifica las transacciones con valores nulos en la columna (`Amount`) . Rellena esos valores con la mediana de los montos por tipo de transacción (`Transaction_Type`) y luego calcula el monto total de transacciones por región (`region`) .

In [22]:
# Solución
# Transacciones con valores nulos en "Amount"
null_transactions = df_base_financiera[df_base_financiera["Amount"].isnull()]

# Mediana de "Amount" por tipo de transacción
median_by_type = df_base_financiera.groupby("Transaction_Type")["Amount"].median()

# Completamos los valores nulos con la mediana correspondiente
df_base_financiera["Amount"] = df_base_financiera.apply(
    lambda row: median_by_type[row["Transaction_Type"]] if pd.isnull(row["Amount"]) else row["Amount"], axis=1
)
# Monto total de transacciones por región
total_by_region = df_base_financiera.groupby("Region")["Amount"].sum()
print("Monto total por región:")
print(total_by_region)

Monto total por región:
Region
East     1269409.53
North    1321224.96
South    1208300.23
West     1233552.50
Name: Amount, dtype: float64

10. Busca transacciones duplicadas considerando las columnas (`Customer_ID`) y (`Date`). Elimina los duplicados manteniendo solo la primera ocurrencia. Luego, agrupa las transacciones restantes por (`Customer_ID`) y calcula el monto promedio y la cantidad de transacciones por cliente.

In [24]:
# Solución
# Buscamos y eliminamos duplicados considerando "Customer_ID" y "Date"
df_base_financiera = df_base_financiera.drop_duplicates(subset=["Customer_ID", "Date"], keep="first")

# Agrupamos por "Customer_ID" y calculamos el monto promedio y cantidad de transacciones
customer_stats = df_base_financiera.groupby("Customer_ID").agg(
    promedio_amount=("Amount", "mean"),
    cantidad_transacciones=("Amount", "count")
)

print("Estadísticas por cliente:")
print(customer_stats)

Estadísticas por cliente:
             promedio_amount  cantidad_transacciones
Customer_ID
C001             3283.319412                      17
C002             1881.827778                       9
C003             3102.125000                      14
C004             2879.267143                       7
C005             3364.053333                       6
...                      ...                     ...
C196             2566.555000                      10
C197             2530.674286                      14
C198             2484.925000                      12
C199             2942.038000                       5
C200             2196.990000                       5

[200 rows x 2 columns]